CSI API ETABS v1
cPropLink.GetRubberIsolator Method
 retrieves link property data for a rubber isolator-type link property.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetRubberIsolator(
	string Name,
	ref bool[] DOF,
	ref bool[] Fixed,
	ref bool[] Nonlinear,
	ref double[] Ke,
	ref double[] Ce,
	ref double[] K,
	ref double[] Yield,
	ref double[] Ratio,
	ref double DJ2,
	ref double DJ3,
	ref string Notes,
	ref string GUID
)
Function GetRubberIsolator (
	Name As String,
	ByRef DOF As Boolean(),
	ByRef Fixed As Boolean(),
	ByRef Nonlinear As Boolean(),
	ByRef Ke As Double(),
	ByRef Ce As Double(),
	ByRef K As Double(),
	ByRef Yield As Double(),
	ByRef Ratio As Double(),
	ByRef DJ2 As Double,
	ByRef DJ3 As Double,
	ByRef Notes As String,
	ByRef GUID As String
) As Integer
Dim instance As cPropLink
Dim Name As String
Dim DOF As Boolean()
Dim Fixed As Boolean()
Dim Nonlinear As Boolean()
Dim Ke As Double()
Dim Ce As Double()
Dim K As Double()
Dim Yield As Double()
Dim Ratio As Double()
Dim DJ2 As Double
Dim DJ3 As Double
Dim Notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.GetRubberIsolator(Name,
	DOF, Fixed, Nonlinear, Ke, Ce, K, Yield,
	Ratio, DJ2, DJ3, Notes, GUID)
int GetRubberIsolator(
	String^ Name,
	array<bool>^% DOF,
	array<bool>^% Fixed,
	array<bool>^% Nonlinear,
	array<double>^% Ke,
	array<double>^% Ce,
	array<double>^% K,
	array<double>^% Yield,
	array<double>^% Ratio,
	double% DJ2,
	double% DJ3,
	String^% Notes,
	String^% GUID
)
abstract GetRubberIsolator :
        Name : string *
        DOF : bool[] byref *
        Fixed : bool[] byref *
        Nonlinear : bool[] byref *
        Ke : float[] byref *
        Ce : float[] byref *
        K : float[] byref *
        Yield : float[] byref *
        Ratio : float[] byref *
        DJ2 : float byref *
        DJ3 : float byref *
        Notes : string byref *
        GUID : string byref -> int
Parameters
Name
Type: System.String
The name of an existing rubber isolator-type link property.
DOF
Type: System.Boolean[]
This is a boolean array, dimensioned to 5, indicating if properties exist for a specified degree of freedom.
Value | DOF
DOF(0) | U1
DOF(1) | U2
DOF(2) | U3
DOF(3) | R1
DOF(4) | R2
DOF(5) | R3
Fixed
Type: System.Boolean[]
This is a boolean array, dimensioned to 5, indicating if the specified degree of freedom is fixed (restrained).
Value | Fixity
Fixed(0) | U1 fixity if DOF(0) = True
Fixed(1) | U2 fixity if DOF(1) = True
Fixed(2) | U3 fixity if DOF(2) = True
Fixed(3) | R1 fixity if DOF(3) = True
Fixed(4) | R2 fixity if DOF(4) = True
Fixed(5) | R3 fixity if DOF(5) = True
Nonlinear
Type: System.Boolean[]
This is a boolean array, dimensioned to 5, indicating if nonlinear properties exist for a specified degree of freedom.
Value | Nonlinear
Nonlinear(0) | U1 has nonlinear properties
Nonlinear(1) | U2 has nonlinear properties
Nonlinear(2) | U3 has nonlinear properties
Nonlinear(3) | R1, not used
Nonlinear(4) | R2, not used
Nonlinear(5) | R3, not used
Note that this item is applicable only for degrees of freedom U1, U2 and U3. For those degrees of freedom, the term Nonlinear(n) applies only when DOF(n) = True and Fixed(n) = False.
Ke
Type: System.Double[]
This is an array of effective stiffness terms for the link property. The effective stiffness applies for linear analyses.
Value | Stiffness
Ke(0) | U1 [F/L]
Ke(1) | U2 [F/L]
Ke(2) | U3 [F/L]
Ke(3) | R1 [FL]
Ke(4) | R2 [FL]
Ke(5) | R3 [FL]
The term ke(n) applies only when DOF(n) = True and Fixed(n) = False.
Ce
Type: System.Double[]
This is an array of effective damping terms for the link property. The effective stiffness applies for linear analyses.
Value | Damping
Ce(0) | U1 [F/L]
Ce(1) | U2 [F/L]
Ce(2) | U3 [F/L]
Ce(3) | R1 [FL]
Ce(4) | R2 [FL]
Ce(5) | R3 [FL]
The term ce(n) applies only when DOF(n) = True and Fixed(n) = False.
K
Type: System.Double[]
This is an array of initial stiffness terms for the link property. The initial stiffness applies for nonlinear analyses.
Value | Stiffness
K(0) | U1, not used
K(1) | U2 [F/L]
K(2) | U3 [F/L]
K(3) | R1, not used
K(4) | R2, not used
K(5) | R3, not used
Note that this item is applicable only for degrees of freedom U2 and U3. For those degrees of freedom, the term k(n) applies only when DOF(n) = True, Fixed(n) = False, and Nonlinear(n) = True.
Yield
Type: System.Double[]
This is an array of yield force terms for the link property. The yield force applies for nonlinear analyses.
Value | Yield
yield(0) | U1, not used
yield(1) | U2 [F]
yield(2) | U3 [F]
yield(3) | R1, not used
yield(4) | R2, not used
yield(5) | R3, not used
Note that this item is applicable only for degrees of freedom U2 and U3. For those degrees of freedom, the term Yield(n) applies only when DOF(n) = True, Fixed(n) = False, and Nonlinear(n) = True.
Ratio
Type: System.Double[]
This is an array of post-yield stiffness ratio terms for the link property. The post-yield stiffness ratio applies for nonlinear analyses. It is the post-yield stiffness divided by the initial stiffness.
Value | Ratio
Ratio(0) | U1, not used
Ratio(1) | U2
Ratio(2) | U3
Ratio(3) | R1, not used
Ratio(4) | R2, not used
Ratio(5) | R3, not used
Note that this item is applicable only for degrees of freedom U2 and U3. For those degrees of freedom, the term Ratio(n) applies only when DOF(n) = True, Fixed(n) = False, and Nonlinear(n) = True.
DJ2
Type: System.Double
The distance from the J-End of the link to the U2 shear spring. This item applies only when DOF(1) = True. [L]
DJ3
Type: System.Double
The distance from the J-End of the link to the U3 shear spring. This item applies only when DOF(2) = True. [L]
Notes
Type: System.String
The notes, if any, assigned to the property.
GUID
Type: System.String
The GUID (global unique identifier), if any, assigned to the property.
Return Value
Type: Int32
Returns zero if the property is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim MyDOF() As Boolean
       Dim MyFixed() As Boolean
       Dim MyNonLinear() as Boolean
       Dim MyKe() As Double
       Dim MyCe() As Double
       Dim MyK() As Double
       Dim MyYield() As Double
       Dim MyRatio() As Double
       Dim DOF() As Boolean
       Dim Fixed() As Boolean
       Dim NonLinear() as Boolean
       Dim Ke() As Double
       Dim Ce() As Double
       Dim K() As Double
       Dim Yield() As Double
       Dim Ratio() As Double
       Dim dj2 As Double
       Dim dj3 As Double
       Dim Notes As String
       Dim GUID As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link property
       ReDim MyDOF(5)
       ReDim MyFixed(5)
       ReDim MyNonLinear(5)
       ReDim MyKe(5)
       ReDim MyCe(5)
       ReDim MyK(5)
       ReDim MyYield(5)
       ReDim MyRatio(5)
       MyDOF(0) = True
       MyKe(0) = 12
       MyCe(0) = 0.01
       MyDOF(1) = True
       MyNonLinear(1) = True
       MyKe(1) = 12
       MyCe(1) = 0.01
       MyK(1) = 20
       MyYield(1)= 50
       MyRatio(1)= 0.1
       MyDOF(2) = True
       MyNonLinear(2) = True
       MyKe(2) = 15
       MyCe(2) = 0.008
       MyK(2) = 22
       MyYield(2)= 60
       MyRatio(2)= 0.15
       MyDOF(3) = True
       MyFixed(3) = True
       ret = SapModel.PropLink.SetRubberIsolator("RI1", MyDOF, MyFixed, MyNonLinear, MyKe, MyCe, MyK, MyYield, MyRatio, 2, 3)
   'get link property data
       ret = SapModel.PropLink.GetRubberIsolator("RI1", DOF, Fixed, NonLinear, Ke, Ce, k, Yield, Ratio, dj2, dj3, Notes, GUID)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropLink Interface
ETABSv1 Namespace